zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_system.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_system.h
  * @author  MCD Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Access to DBGCMU registers
      (+) Access to SYSCFG registers

  @endverbatim
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_LL_SYSTEM_H
#define __STM32MP2xx_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

#if defined(CORE_CA35) || defined(CORE_CM33)


/** @defgroup SYSTEM_LL_EC_CS1 SYSCFG Vdd compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_VDD_CELL_CODE                  0U                   /*VDD I/Os code from the cell
                                                                      (available in the SYSCFG_VDDCCCR)*/
#define LL_SYSCFG_VDD_REGISTER_CODE              SYSCFG_VDDCCCR_CS    /*VDD I/Os code from the SYSCFG compensation
                                                                        cell code register (SYSCFG_VDDCCCR)*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_CS2 SYSCFG VddIO1 compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_VDDIO1_CELL_CODE                0U                    /*VDDIO1 I/Os code from the cell
                                                                        (available in the SYSCFG_VDDIO1CCCR)*/
#define LL_SYSCFG_VDDIO1_REGISTER_CODE            SYSCFG_VDDIO1CCCR_CS  /*VDDIO1 I/Os code from the SYSCFG compensation
                                                                        cell code register (SYSCFG_VDDIO1CCCR)*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_CS3 SYSCFG VddIO2 compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_VDDIO2_CELL_CODE                0U                    /*VDDIO2 I/Os code from the cell
                                                                        (available in the SYSCFG_VDDIO2CCCR)*/
#define LL_SYSCFG_VDDIO2_REGISTER_CODE            SYSCFG_VDDIO2CCCR_CS  /*VDDIO2 I/Os code from the SYSCFG compensation
                                                                        cell code register (SYSCFG_VDDIO2CCCR)*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_CS4 SYSCFG VddIO3 compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_VDDIO3_CELL_CODE                0U                    /*VDDIO3 I/Os code from the cell
                                                                        (available in the SYSCFG_VDDIO3CCCR)*/
#define LL_SYSCFG_VDDIO3_REGISTER_CODE            SYSCFG_VDDIO3CCCR_CS  /*VDDIO3 I/Os code from the SYSCFG compensation
                                                                        cell code register (SYSCFG_VDDIO3CCCR)*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_CS5 SYSCFG VddIO4 compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_VDDIO4_CELL_CODE                0U                    /*VDDIO4 I/Os code from the cell
                                                                        (available in the SYSCFG_VDDIO4CCCR)*/
#define LL_SYSCFG_VDDIO4_REGISTER_CODE            SYSCFG_VDDIO4CCCR_CS  /*VDDIO4 I/Os code from the SYSCFG compensation
                                                                        cell code register (SYSCFG_VDDIO4CCCR)*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_IWDG DBGMCU IWDG Freeze Watchdog
  * @{
  */
#define LL_DBGMCU_IWDG_FREEZE_1CA35_HALT   0U                         /*!< Freeze Watchdog timer when either CA35 core halt in secure debug mode */
#define LL_DBGMCU_IWDG_FREEZE_2CA35_HALT   DBGMCU_CRA35_WDFZCTL       /*!< Freeze Watchdog timer when both CA35 cores halt in secure debug mode */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_GRP1_STOP_IP  DBGMCU APB1 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB1_GRP1_TIM2_STOP         DBGMCU_APB1FZ_DBG_TIM2_STOP         /*!< TIM2 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM3_STOP         DBGMCU_APB1FZ_DBG_TIM3_STOP         /*!< TIM3 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM4_STOP         DBGMCU_APB1FZ_DBG_TIM4_STOP         /*!< TIM4 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM5_STOP         DBGMCU_APB1FZ_DBG_TIM5_STOP         /*!< TIM5 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM6_STOP         DBGMCU_APB1FZ_DBG_TIM6_STOP         /*!< TIM6 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM7_STOP         DBGMCU_APB1FZ_DBG_TIM7_STOP         /*!< TIM7 counter stopped when core is halted  */
#define LL_DBGMCU_APB1_GRP1_TIM10_STOP        DBGMCU_APB1FZ_DBG_TIM10_STOP        /*!< TIM10 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM11_STOP        DBGMCU_APB1FZ_DBG_TIM11_STOP        /*!< TIM11 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM12_STOP        DBGMCU_APB1FZ_DBG_TIM12_STOP        /*!< TIM12 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM13_STOP        DBGMCU_APB1FZ_DBG_TIM13_STOP        /*!< TIM13 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM14_STOP        DBGMCU_APB1FZ_DBG_TIM14_STOP        /*!< TIM14 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_LPTIM1_STOP       DBGMCU_APB1FZ_DBG_LPTIM1_STOP       /*!< LPTIM1 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_LPTIM2_STOP       DBGMCU_APB1FZ_DBG_LPTIM2_STOP       /*!< LPTIM2 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C1_STOP         DBGMCU_APB1FZ_DBG_I2C1_STOP         /*!< I2C1 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C2_STOP         DBGMCU_APB1FZ_DBG_I2C2_STOP         /*!< I2C2 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C3_STOP         DBGMCU_APB1FZ_DBG_I2C3_STOP         /*!< I2C3 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C4_STOP         DBGMCU_APB1FZ_DBG_I2C4_STOP         /*!< I2C4 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C5_STOP         DBGMCU_APB1FZ_DBG_I2C5_STOP         /*!< I2C5 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C6_STOP         DBGMCU_APB1FZ_DBG_I2C6_STOP         /*!< I2C6 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C7_STOP         DBGMCU_APB1FZ_DBG_I2C7_STOP         /*!< I2C7 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I3C1_STOP         DBGMCU_APB1FZ_DBG_I3C1_STOP         /*!< I3C1 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I3C2_STOP         DBGMCU_APB1FZ_DBG_I3C2_STOP         /*!< I3C2 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I3C3_STOP         DBGMCU_APB1FZ_DBG_I3C3_STOP         /*!< I3C3 SMBUS timeout mode stopped when Core is halted */
/**
  * @}
  */

