zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_system.h
/** @defgroup SYSTEM_LL_EC_APB2_GRP1_STOP_IP  DBGMCU APB2 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB2_GRP1_TIM1_STOP         DBGMCU_APB2FZ_DBG_TIM1_STOP         /*!< TIM1 counter stopped when core is halted */
#define LL_DBGMCU_APB2_GRP1_TIM8_STOP         DBGMCU_APB2FZ_DBG_TIM8_STOP         /*!< TIM8 counter stopped when core is halted */
#define LL_DBGMCU_APB2_GRP1_TIM15_STOP        DBGMCU_APB2FZ_DBG_TIM15_STOP        /*!< TIM15 counter stopped when core is halted */
#define LL_DBGMCU_APB2_GRP1_TIM16_STOP        DBGMCU_APB2FZ_DBG_TIM16_STOP        /*!< TIM16 counter stopped when core is halted */
#define LL_DBGMCU_APB2_GRP1_TIM17_STOP        DBGMCU_APB2FZ_DBG_TIM17_STOP        /*!< TIM17 counter stopped when core is halted */
#define LL_DBGMCU_APB2_GRP1_TIM20_STOP        DBGMCU_APB2FZ_DBG_TIM20_STOP        /*!< TIM20 counter stopped when core is halted */
#define LL_DBGMCU_APB2_GRP1_FDCAN_STOP        DBGMCU_APB2FZ_DBG_FDCAN_STOP        /*!< FDCAN stopped when core is halted */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB3_GRP1_STOP_IP  DBGMCU APB3 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB3_GRP1_IWDG1_STOP        DBGMCU_APB3FZ_DBG_IWDG1_STOP        /*!< IWDG1 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_IWDG2_STOP        DBGMCU_APB3FZ_DBG_IWDG2_STOP        /*!< IWDG2 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_IWDG3_STOP        DBGMCU_APB3FZ_DBG_IWDG3_STOP        /*!< IWDG3 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_IWDG4_STOP        DBGMCU_APB3FZ_DBG_IWDG4_STOP        /*!< IWDG4 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_WWDG1_STOP        DBGMCU_APB3FZ_DBG_WWDG1_STOP        /*!< WWDG1 counter stopped when core is halted */

/** @defgroup SYSTEM_LL_EC_CRA35_GRP1_STOP_IP  DBGMCU CRA35 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_CRA35_DBG_STGEN_STOP        DBGMCU_CRA35_DBG_STGEN_STOP         /*!< STGEN counter stopped when CA35 core is halted */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APBSR_GRP1_STOP_IP  DBGMCU APBSR GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APBSR_GRP1_RTC_STOP         DBGMCU_APBSRFZ_DBG_RTC_STOP         /*!< RTC stopped when Core is halted */
#define LL_DBGMCU_APBSR_GRP1_I3C4_STOP        DBGMCU_APBSRFZ_DBG_I3C4_STOP        /*!< I3C4 stopped when Core is halted */
#define LL_DBGMCU_APBSR_GRP1_I2C8_STOP        DBGMCU_APBSRFZ_DBG_I2C8_STOP        /*!< I2C8 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APBSR_GRP1_LPTIM3_STOP      DBGMCU_APBSRFZ_DBG_LPTIM3_STOP      /*!< LPTIM3 counter stopped when core is halted */
#define LL_DBGMCU_APBSR_GRP1_LPTIM4_STOP      DBGMCU_APBSRFZ_DBG_LPTIM4_STOP      /*!< LPTIM4 counter stopped when core is halted */
#define LL_DBGMCU_APBSR_GRP1_LPTIM5_STOP      DBGMCU_APBSRFZ_DBG_LPTIM5_STOP      /*!< LPTIM5 counter stopped when core is halted */
#define LL_DBGMCU_APBSR_GRP1_IWDG5_STOP       DBGMCU_APBSRFZ_DBG_IWDG5_STOP       /*!< IWDG5 counter stopped when core is halted */
#define LL_DBGMCU_APBSR_GRP1_WWDG2_STOP       DBGMCU_APBSRFZ_DBG_WWDG2_STOP       /*!< WWDG2 counter stopped when core is halted */

/** @defgroup SYSTEM_LL_EC_AHB2_GRP1_STOP_IP  DBGMCU AHB2 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH0_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP  /*!< HDPMA1 Channel 0 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH1_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP  /*!< HDPMA1 Channel 1 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH2_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP  /*!< HDPMA1 Channel 2 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH3_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP  /*!< HDPMA1 Channel 3 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH4_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP  /*!< HDPMA1 Channel 4 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH5_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP  /*!< HDPMA1 Channel 5 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH6_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP  /*!< HDPMA1 Channel 6 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH7_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP  /*!< HDPMA1 Channel 7 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH8_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP  /*!< HDPMA1 Channel 8 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH9_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP  /*!< HDPMA1 Channel 9 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH10_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP /*!< HDPMA1 Channel 10 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH11_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP /*!< HDPMA1 Channel 11 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH12_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP /*!< HDPMA1 Channel 12 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH13_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP /*!< HDPMA1 Channel 13 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH14_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP /*!< HDPMA1 Channel 14 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA1_CH15_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP /*!< HDPMA1 Channel 15 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH0_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP  /*!< HDPMA2 Channel 0 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH1_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP  /*!< HDPMA2 Channel 1 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH2_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP  /*!< HDPMA2 Channel 2 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH3_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP  /*!< HDPMA2 Channel 3 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH4_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP  /*!< HDPMA2 Channel 4 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH5_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP  /*!< HDPMA2 Channel 5 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH6_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP  /*!< HDPMA2 Channel 6 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH7_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP  /*!< HDPMA2 Channel 7 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH8_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP  /*!< HDPMA2 Channel 8 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH9_STOP   DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP  /*!< HDPMA2 Channel 9 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH10_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP /*!< HDPMA2 Channel 10 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH11_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP /*!< HDPMA2 Channel 11 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH12_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP /*!< HDPMA2 Channel 12 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH13_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP /*!< HDPMA2 Channel 13 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH14_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP /*!< HDPMA2 Channel 14 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP1_HPDMA2_CH15_STOP  DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP /*!< HDPMA2 Channel 15 stopped when core is halted */

/**
  * @}
  */

