zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_system.h
/** @defgroup SYSTEM_LL_EC_AHB2_GRP2_STOP_IP  DBGMCU AHB2 GRP2 STOP IP
  * @{
  */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH0_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP  /*!< HDPMA3 Channel 0 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH1_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP  /*!< HDPMA3 Channel 1 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH2_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP  /*!< HDPMA3 Channel 2 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH3_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP  /*!< HDPMA3 Channel 3 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH4_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP  /*!< HDPMA3 Channel 4 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH5_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP  /*!< HDPMA3 Channel 5 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH6_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP  /*!< HDPMA3 Channel 6 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH7_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP  /*!< HDPMA3 Channel 7 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH8_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP  /*!< HDPMA3 Channel 8 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH9_STOP   DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP  /*!< HDPMA3 Channel 9 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH10_STOP  DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP /*!< HDPMA3 Channel 10 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH11_STOP  DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP /*!< HDPMA3 Channel 11 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH12_STOP  DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP /*!< HDPMA3 Channel 12 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH13_STOP  DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP /*!< HDPMA3 Channel 13 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH14_STOP  DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP /*!< HDPMA3 Channel 14 stopped when core is halted */
#define LL_DBGMCU_AHB2_GRP2_HPDMA3_CH15_STOP  DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP /*!< HDPMA3 Channel 15 stopped when core is halted */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_AHBSR_GRP1_STOP_IP  DBGMCU AHBSR GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_AHBSR_GRP1_LPDMA_CH0_STOP   DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP   /*!< LPDMA Channel 0 stopped when core is halted */
#define LL_DBGMCU_AHBSR_GRP1_LPDMA_CH1_STOP   DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP   /*!< LPDMA Channel 1 stopped when core is halted */
#define LL_DBGMCU_AHBSR_GRP1_LPDMA_CH2_STOP   DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP   /*!< LPDMA Channel 2 stopped when core is halted */
#define LL_DBGMCU_AHBSR_GRP1_LPDMA_CH3_STOP   DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP   /*!< LPDMA Channel 3 stopped when core is halted */

/**
  * @}
  */

/**
  * @}
  */
#endif /* CORE_CA35 || CORE_CM33 */


/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */

/** @defgroup SYSTEM_LL_EF_COMPENSATION SYSCFG COMPENSATION
  * @{
  */

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDD
  * @rmtoll VDDCCSR  APSRC  LL_SYSCFG_GetPMOSVddCompensationValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddCompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDCCSR, SYSCFG_VDDCCSR_APSRC) >> SYSCFG_VDDCCSR_APSRC_Pos);
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDD
  * @rmtoll VDDCCSR  ANSRC   LL_SYSCFG_GetNMOSVddCompensationValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddCompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDCCSR, SYSCFG_VDDCCSR_ANSRC) >> SYSCFG_VDDCCSR_ANSRC_Pos);
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDD
  * @rmtoll VDDCCCR    RAPSRC  LL_SYSCFG_SetPMOSVddCompensationCode
  * @param  PMOSCode PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddCompensationCode(uint32_t PMOSCode)
{
  MODIFY_REG(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_RAPSRC, PMOSCode << SYSCFG_VDDCCCR_RAPSRC_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDD
  * @rmtoll VDDCCCR    RAPSRC   LL_SYSCFG_GetPMOSVddCompensationCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_RAPSRC) >> SYSCFG_VDDCCCR_RAPSRC_Pos);
}


/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDD
  * @rmtoll VDDCCCR    RANSRC  LL_SYSCFG_SetNMOSVddCompensationCode
  * @param  NMOSCode NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddCompensationCode(uint32_t NMOSCode)
{
  MODIFY_REG(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_RANSRC, NMOSCode << SYSCFG_VDDCCCR_RANSRC_Pos);
}


/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDD
  * @rmtoll VDDCCCR    RANSRC   LL_SYSCFG_GetNMOSVddCompensationCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_RANSRC) >> SYSCFG_VDDCCCR_RANSRC_Pos);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDD
  * @rmtoll VDDCCCR   EN    LL_SYSCFG_EnableVddCompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddCompensationCell(void)
{
  SET_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_EN);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDD
  * @rmtoll VDDCCCR   EN    LL_SYSCFG_DisableVddCompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddCompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_EN);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDD is enable
  * @rmtoll VDDCCCR   EN   LL_SYSCFG_IsEnabled_VddCompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddCompensationCell(void)
{
  return ((READ_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_EN) == SYSCFG_VDDCCCR_EN) ? 1UL : 0UL);
}

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDD
  * @rmtoll VDDCCSR   READY   LL_SYSCFG_IsActiveFlag_VddCMPCR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_VddCMPCR(void)
{
  return ((READ_BIT(SYSCFG->VDDCCSR, SYSCFG_VDDCCSR_READY) == (SYSCFG_VDDCCSR_READY)) ? 1UL : 0UL);
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDD
  * @rmtoll VDDCCCR   CS    LL_SYSCFG_SetVddCellCompensationCode
  * @param  CompCode: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_VDD_CELL_CODE : Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDD_REGISTER_CODE: Select Code from the SYSCFG compensation cell code register (SYSCFG_CCCR)
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetVddCellCompensationCode(uint32_t CompCode)
{
  SET_BIT(SYSCFG->VDDCCCR, CompCode);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDD
  * @rmtoll VDDCCCR   CS    LL_SYSCFG_GetVddCellCompensationCode
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_VDD_CELL_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDD_REGISTER_CODE: Selected Code is from the SYSCFG compensation
      cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddCellCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_CS));
}

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDDIO1
  * @rmtoll VDDIO1CCSR  APSRC  LL_SYSCFG_GetPMOSVddIO1CompensationValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO1CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO1CCSR, SYSCFG_VDDIO1CCSR_APSRC) >> SYSCFG_VDDIO1CCSR_APSRC_Pos);
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDDIO1
  * @rmtoll VDDIO1CCSR  ANSRC   LL_SYSCFG_GetNMOSVddIO1CompensationValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO1CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO1CCSR, SYSCFG_VDDIO1CCSR_ANSRC) >> SYSCFG_VDDIO1CCSR_ANSRC_Pos);
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDDIO1
  * @rmtoll VDDIO1CCCR    RAPSRC  LL_SYSCFG_SetPMOSVddIO1CompensationCode
  * @param  PMOSCode PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddIO1CompensationCode(uint32_t PMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_RAPSRC, PMOSCode << SYSCFG_VDDIO1CCCR_RAPSRC_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDDIO1
  * @rmtoll VDDIO1CCCR    RAPSRC   LL_SYSCFG_GetPMOSVddIO1CompensationCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO1CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_RAPSRC) >> SYSCFG_VDDIO1CCCR_RAPSRC_Pos);
}


/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDDIO1
  * @rmtoll VDDIO1CCCR    RANSRC  LL_SYSCFG_SetNMOSVddIO1CompensationCode
  * @param  NMOSCode NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddIO1CompensationCode(uint32_t NMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_RANSRC, NMOSCode << SYSCFG_VDDIO1CCCR_RANSRC_Pos);
}


/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDDIO1
  * @rmtoll VDDIO1CCCR    RANSRC   LL_SYSCFG_GetNMOSVddIO1CompensationCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO1CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_RANSRC) >> SYSCFG_VDDIO1CCCR_RANSRC_Pos);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDDIO1
  * @rmtoll VDDIO1CCCR   EN    LL_SYSCFG_EnableVddIO1CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddIO1CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_EN);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDDIO1
  * @rmtoll VDDIO1CCCR   EN    LL_SYSCFG_DisableVddIO1CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddIO1CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_EN);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDDIO1 is enable
  * @rmtoll VDDIO1CCCR   EN   LL_SYSCFG_IsEnabled_VddIO1CompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddIO1CompensationCell(void)
{
  return ((READ_BIT(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_EN) == SYSCFG_VDDIO1CCCR_EN) ? 1UL : 0UL);
}

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDDIO1
  * @rmtoll VDDIO1CCSR   READY   LL_SYSCFG_IsActiveFlag_VddIO1CMPCR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_VddIO1CMPCR(void)
{
  return ((READ_BIT(SYSCFG->VDDIO1CCSR, SYSCFG_VDDIO1CCSR_READY) == (SYSCFG_VDDIO1CCSR_READY)) ? 1UL : 0UL);
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDDIO1
  * @rmtoll VDDIO1CCCR   CS    LL_SYSCFG_SetVddIO1CellCompensationCode
  * @param  CompCode: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO1_CELL_CODE : Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO1_REGISTER_CODE: Select Code from the SYSCFG compensation cell code register (SYSCFG_CCCR)
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetVddIO1CellCompensationCode(uint32_t CompCode)
{
  SET_BIT(SYSCFG->VDDIO1CCCR, CompCode);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDDIO1
  * @rmtoll VDDIO1CCCR   CS    LL_SYSCFG_GetVddIO1CellCompensationCode
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO1_CELL_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO1_REGISTER_CODE: Selected Code is from the SYSCFG compensation
      cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddIO1CellCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO1CCCR, SYSCFG_VDDIO1CCCR_CS));
}

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDDIO2
  * @rmtoll VDDIO2CCSR  APSRC  LL_SYSCFG_GetPMOSVddIO2CompensationValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO2CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO2CCSR, SYSCFG_VDDIO2CCSR_APSRC) >> SYSCFG_VDDIO2CCSR_APSRC_Pos);
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDDIO2
  * @rmtoll VDDIO2CCSR  ANSRC   LL_SYSCFG_GetNMOSVddIO2CompensationValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO2CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO2CCSR, SYSCFG_VDDIO2CCSR_ANSRC) >> SYSCFG_VDDIO2CCSR_ANSRC_Pos);
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDDIO2
  * @rmtoll VDDIO2CCCR    RAPSRC  LL_SYSCFG_SetPMOSVddIO2CompensationCode
  * @param  PMOSCode PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddIO2CompensationCode(uint32_t PMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_RAPSRC, PMOSCode << SYSCFG_VDDIO2CCCR_RAPSRC_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDDIO2
  * @rmtoll VDDIO2CCCR    RAPSRC   LL_SYSCFG_GetPMOSVddIO2CompensationCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO2CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_RAPSRC) >> SYSCFG_VDDIO2CCCR_RAPSRC_Pos);
}


/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDDIO2
  * @rmtoll VDDIO2CCCR    RANSRC  LL_SYSCFG_SetNMOSVddIO2CompensationCode
  * @param  NMOSCode NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddIO2CompensationCode(uint32_t NMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_RANSRC, NMOSCode << SYSCFG_VDDIO2CCCR_RANSRC_Pos);
}


/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDDIO2
  * @rmtoll VDDIO2CCCR    RANSRC   LL_SYSCFG_GetNMOSVddIO2CompensationCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO2CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_RANSRC) >> SYSCFG_VDDIO2CCCR_RANSRC_Pos);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDDIO2
  * @rmtoll VDDIO2CCCR   EN    LL_SYSCFG_EnableVddIO2CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddIO2CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_EN);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDDIO2
  * @rmtoll VDDIO2CCCR   EN    LL_SYSCFG_DisableVddIO2CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddIO2CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_EN);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDDIO2 is enable
  * @rmtoll VDDIO2CCCR   EN   LL_SYSCFG_IsEnabled_VddIO2CompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddIO2CompensationCell(void)
{
  return ((READ_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_EN) == SYSCFG_VDDIO2CCCR_EN) ? 1UL : 0UL);
}

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDDIO2
  * @rmtoll VDDIO2CCSR   READY   LL_SYSCFG_IsActiveFlag_VddIO2CMPCR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_VddIO2CMPCR(void)
{
  return ((READ_BIT(SYSCFG->VDDIO2CCSR, SYSCFG_VDDIO2CCSR_READY) == (SYSCFG_VDDIO2CCSR_READY)) ? 1UL : 0UL);
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDDIO2
  * @rmtoll VDDIO2CCCR   CS    LL_SYSCFG_SetVddIO2CellCompensationCode
  * @param  CompCode: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO2_CELL_CODE : Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO2_REGISTER_CODE: Select Code from the SYSCFG compensation cell code register (SYSCFG_CCCR)
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetVddIO2CellCompensationCode(uint32_t CompCode)
{
  SET_BIT(SYSCFG->VDDIO2CCCR, CompCode);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDDIO2
  * @rmtoll VDDIO2CCCR   CS    LL_SYSCFG_GetVddIO2CellCompensationCode
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO2_CELL_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO2_REGISTER_CODE: Selected Code is from the SYSCFG compensation
      cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddIO2CellCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_CS));
}

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDDIO3
  * @rmtoll VDDIO3CCSR  APSRC  LL_SYSCFG_GetPMOSVddIO3CompensationValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO3CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO3CCSR, SYSCFG_VDDIO3CCSR_APSRC) >> SYSCFG_VDDIO3CCSR_APSRC_Pos);
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDDIO3
  * @rmtoll VDDIO3CCSR  ANSRC   LL_SYSCFG_GetNMOSVddIO3CompensationValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO3CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO3CCSR, SYSCFG_VDDIO3CCSR_ANSRC) >> SYSCFG_VDDIO3CCSR_ANSRC_Pos);
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDDIO3
  * @rmtoll VDDIO3CCCR    RAPSRC  LL_SYSCFG_SetPMOSVddIO3CompensationCode
  * @param  PMOSCode PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddIO3CompensationCode(uint32_t PMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_RAPSRC, PMOSCode << SYSCFG_VDDIO3CCCR_RAPSRC_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDDIO3
  * @rmtoll VDDIO3CCCR    RAPSRC   LL_SYSCFG_GetPMOSVddIO3CompensationCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO3CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_RAPSRC) >> SYSCFG_VDDIO3CCCR_RAPSRC_Pos);
}


/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDDIO3
  * @rmtoll VDDIO3CCCR    RANSRC  LL_SYSCFG_SetNMOSVddIO3CompensationCode
  * @param  NMOSCode NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddIO3CompensationCode(uint32_t NMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_RANSRC, NMOSCode << SYSCFG_VDDIO3CCCR_RANSRC_Pos);
}


/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDDIO3
  * @rmtoll VDDIO3CCCR    RANSRC   LL_SYSCFG_GetNMOSVddIO3CompensationCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO3CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_RANSRC) >> SYSCFG_VDDIO3CCCR_RANSRC_Pos);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDDIO3
  * @rmtoll VDDIO3CCCR   EN    LL_SYSCFG_EnableVddIO3CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddIO3CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_EN);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDDIO3
  * @rmtoll VDDIO3CCCR   EN    LL_SYSCFG_DisableVddIO3CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddIO3CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_EN);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDDIO3 is enable
  * @rmtoll VDDIO3CCCR   EN   LL_SYSCFG_IsEnabled_VddIO3CompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddIO3CompensationCell(void)
{
  return ((READ_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_EN) == SYSCFG_VDDIO3CCCR_EN) ? 1UL : 0UL);
}

