zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_system.h
/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDDIO3
  * @rmtoll VDDIO3CCSR   READY   LL_SYSCFG_IsActiveFlag_VddIO3CMPCR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_VddIO3CMPCR(void)
{
  return ((READ_BIT(SYSCFG->VDDIO3CCSR, SYSCFG_VDDIO3CCSR_READY) == (SYSCFG_VDDIO3CCSR_READY)) ? 1UL : 0UL);
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDDIO3
  * @rmtoll VDDIO3CCCR   CS    LL_SYSCFG_SetVddIO3CellCompensationCode
  * @param  CompCode: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO3_CELL_CODE : Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO3_REGISTER_CODE: Select Code from the SYSCFG compensation cell code register (SYSCFG_CCCR)
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetVddIO3CellCompensationCode(uint32_t CompCode)
{
  SET_BIT(SYSCFG->VDDIO3CCCR, CompCode);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDDIO3
  * @rmtoll VDDIO3CCCR   CS    LL_SYSCFG_GetVddIO3CellCompensationCode
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO3_CELL_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO3_REGISTER_CODE: Selected Code is from the SYSCFG compensation
      cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddIO3CellCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_CS));
}
/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDDIO4
  * @rmtoll VDDIO4CCSR  APSRC  LL_SYSCFG_GetPMOSVddIO4CompensationValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO4CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO4CCSR, SYSCFG_VDDIO4CCSR_APSRC) >> SYSCFG_VDDIO4CCSR_APSRC_Pos);
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDDIO4
  * @rmtoll VDDIO4CCSR  ANSRC   LL_SYSCFG_GetNMOSVddIO4CompensationValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO4CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO4CCSR, SYSCFG_VDDIO4CCSR_ANSRC) >> SYSCFG_VDDIO4CCSR_ANSRC_Pos);
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDDIO4
  * @rmtoll VDDIO4CCCR    RAPSRC  LL_SYSCFG_SetPMOSVddIO4CompensationCode
  * @param  PMOSCode PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddIO4CompensationCode(uint32_t PMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_RAPSRC, PMOSCode << SYSCFG_VDDIO4CCCR_RAPSRC_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDDIO4
  * @rmtoll VDDIO4CCCR    RAPSRC   LL_SYSCFG_GetPMOSVddIO4CompensationCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO4CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_RAPSRC) >> SYSCFG_VDDIO4CCCR_RAPSRC_Pos);
}


/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDDIO4
  * @rmtoll VDDIO4CCCR    RANSRC  LL_SYSCFG_SetNMOSVddIO4CompensationCode
  * @param  NMOSCode NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddIO4CompensationCode(uint32_t NMOSCode)
{
  MODIFY_REG(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_RANSRC, NMOSCode << SYSCFG_VDDIO4CCCR_RANSRC_Pos);
}


/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDDIO4
  * @rmtoll VDDIO4CCCR    RANSRC   LL_SYSCFG_GetNMOSVddIO4CompensationCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO4CompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_RANSRC) >> SYSCFG_VDDIO4CCCR_RANSRC_Pos);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDDIO4
  * @rmtoll VDDIO4CCCR   EN    LL_SYSCFG_EnableVddIO4CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddIO4CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_EN);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDDIO4
  * @rmtoll VDDIO4CCCR   EN    LL_SYSCFG_DisableVddIO4CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddIO4CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_EN);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDDIO4 is enable
  * @rmtoll VDDIO4CCCR   EN   LL_SYSCFG_IsEnabled_VddIO4CompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddIO4CompensationCell(void)
{
  return ((READ_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_EN) == SYSCFG_VDDIO4CCCR_EN) ? 1UL : 0UL);
}

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDDIO4
  * @rmtoll VDDIO4CCSR   READY   LL_SYSCFG_IsActiveFlag_VddIO4CMPCR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_VddIO4CMPCR(void)
{
  return ((READ_BIT(SYSCFG->VDDIO4CCSR, SYSCFG_VDDIO4CCSR_READY) == (SYSCFG_VDDIO4CCSR_READY)) ? 1UL : 0UL);
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDDIO4
  * @rmtoll VDDIO4CCCR   CS    LL_SYSCFG_SetVddIO4CellCompensationCode
  * @param  CompCode: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO4_CELL_CODE : Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO4_REGISTER_CODE: Select Code from the SYSCFG compensation cell code register (SYSCFG_CCCR)
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetVddIO4CellCompensationCode(uint32_t CompCode)
{
  SET_BIT(SYSCFG->VDDIO4CCCR, CompCode);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDDIO4
  * @rmtoll VDDIO4CCCR   CS    LL_SYSCFG_GetVddIO4CellCompensationCode
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_VDDIO4_CELL_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_VDDIO4_REGISTER_CODE: Selected Code is from the SYSCFG compensation
      cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddIO4CellCompensationCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_CS));
}

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EF_SYSCFG SYSCFG
  * @{
  */

/**
  * @brief  Enable Floating Point Unit Invalid operation Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_0      LL_SYSCFG_EnableIT_FPU_IOC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_IOC(void)
{
  SET_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_0);
}

/**
  * @brief  Enable Floating Point Unit Divide-by-zero Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_1      LL_SYSCFG_EnableIT_FPU_DZC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_DZC(void)
{
  SET_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_1);
}

/**
  * @brief  Enable Floating Point Unit Overflow Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_2      LL_SYSCFG_EnableIT_FPU_OFC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_OFC(void)
{
  SET_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_2);
}

/**
  * @brief  Enable Floating Point Unit Underflow Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_3      LL_SYSCFG_EnableIT_FPU_UFC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_UFC(void)
{
  SET_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_3);
}

/**
  * @brief  Enable Floating Point Unit Inexact Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_4      LL_SYSCFG_EnableIT_FPU_IXC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_IXC(void)
{
  SET_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_4);
}

/**
  * @brief  Enable Floating Point Unit Input abnormal Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_5      LL_SYSCFG_EnableIT_FPU_IDC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_IDC(void)
{
  SET_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_5);
}

/**
  * @brief  Disable Floating Point Unit Invalid operation Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_0      LL_SYSCFG_DisableIT_FPU_IOC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_IOC(void)
{
  CLEAR_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_0);
}

/**
  * @brief  Disable Floating Point Unit Divide-by-zero Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_1      LL_SYSCFG_DisableIT_FPU_DZC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_DZC(void)
{
  CLEAR_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_1);
}

/**
  * @brief  Disable Floating Point Unit Overflow Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_2      LL_SYSCFG_DisableIT_FPU_OFC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_OFC(void)
{
  CLEAR_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_2);
}

/**
  * @brief  Disable Floating Point Unit Underflow Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_3      LL_SYSCFG_DisableIT_FPU_UFC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_UFC(void)
{
  CLEAR_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_3);
}

/**
  * @brief  Disable Floating Point Unit Inexact Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_4      LL_SYSCFG_DisableIT_FPU_IXC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_IXC(void)
{
  CLEAR_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_4);
}

/**
  * @brief  Disable Floating Point Unit Input abnormal Interrupt
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_5      LL_SYSCFG_DisableIT_FPU_IDC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_IDC(void)
{
  CLEAR_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_5);
}

/**
  * @brief  Check whether Floating Point Unit Invalid operation Interrupt source is enabled or disabled.
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_0      LL_SYSCFG_IsEnabledIT_FPU_IOC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_IOC(void)
{
  return ((READ_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_0) == SYSCFG_M33SSCR_FPU_IT_EN_0) ? 1UL : 0UL);
}

/**
  * @brief  Check whether Floating Point Unit Divide-by-zero Interrupt source is enabled or disabled.
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_1      LL_SYSCFG_IsEnabledIT_FPU_DZC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_DZC(void)
{
  return ((READ_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_1) == SYSCFG_M33SSCR_FPU_IT_EN_1) ? 1UL : 0UL);
}

/**
  * @brief  Check whether Floating Point Unit Overflow Interrupt source is enabled or disabled.
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_2      LL_SYSCFG_IsEnabledIT_FPU_OFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_OFC(void)
{
  return ((READ_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_2) == SYSCFG_M33SSCR_FPU_IT_EN_2) ? 1UL : 0UL);
}

/**
  * @brief  Check whether Floating Point Unit Underflow Interrupt source is enabled or disabled.
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_3      LL_SYSCFG_IsEnabledIT_FPU_UFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_UFC(void)
{
  return ((READ_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_3) == SYSCFG_M33SSCR_FPU_IT_EN_3) ? 1UL : 0UL);
}

/**
  * @brief  Check whether Floating Point Unit Inexact Interrupt source is enabled or disabled.
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_4      LL_SYSCFG_IsEnabledIT_FPU_IXC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_IXC(void)
{
  return ((READ_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_4) == SYSCFG_M33SSCR_FPU_IT_EN_4) ? 1UL : 0UL);
}

/**
  * @brief  Check whether Floating Point Unit Input abnormal Interrupt source is enabled or disabled.
  * @rmtoll SYSCFG_M33SSCR FPU_IT_EN_5      LL_SYSCFG_IsEnabledIT_FPU_IDC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_IDC(void)
{
  return ((READ_BIT(SYSCFG->M33SSCR, SYSCFG_M33SSCR_FPU_IT_EN_5) == SYSCFG_M33SSCR_FPU_IT_EN_5) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

#if defined(CORE_CA35) || defined(CORE_CM33)
/** @defgroup SYSTEM_LL_EF_DBGMCU DBGMCU
  * @{
  */

/**
  * @brief  Return the device identifier
  * @note For STM32MP25x devices, the device ID is 0x???
  * @rmtoll DBGMCU_IDCODE DEV_ID        LL_DBGMCU_GetDeviceID
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetDeviceID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_DEV_ID));
}

/**
  * @brief  Return the device revision identifier
  * @note This field indicates the revision of the device.
          For example, it is read as 0x1000 for Revision 1.0.
  * @rmtoll DBGMCU_IDCODE REV_ID        LL_DBGMCU_GetRevisionID
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetRevisionID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_REV_ID) >> DBGMCU_IDCODE_REV_ID_Pos);
}

/**
  * @brief  Enable the Debug Module during SLEEP mode
  * @rmtoll DBGMCU_CR    DBG_SLEEP      LL_DBGMCU_EnableDBGSleepMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Disable the Debug Module during SLEEP mode
  * @rmtoll DBGMCU_CR    DBG_SLEEP      LL_DBGMCU_DisableDBGSleepMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Enable the Debug Module during STOP mode
  * @rmtoll DBGMCU_CR    DBG_STOP      LL_DBGMCU_EnableDBGStopMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the Debug Module during STOP mode
  * @rmtoll DBGMCU_CR    DBG_STOP      LL_DBGMCU_DisableDBGStopMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Enable the Debug Module during STANDBY mode
  * @rmtoll DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_EnableDBGStandbyMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Disable the Debug Module during STANDBY mode
  * @rmtoll DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_DisableDBGStandbyMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Set the Watchdog Timer behaviour
  * @rmtoll DBGMCU_CRA35 WDFZCTL   LL_DBGMCU_SetWatchdogTimerBehaviour\n
  * @param  PinBehaviour This parameter can be one of the following values:
  *         @arg @ref LL_DBGMCU_IWDG_FREEZE_1CA35_HALT
  *         @arg @ref LL_DBGMCU_IWDG_FREEZE_2CA35_HALT
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_SetWatchdogTimerBehaviour(uint32_t PinBehaviour)
{
  MODIFY_REG(DBGMCU->CRA35, DBGMCU_CRA35_WDFZCTL, PinBehaviour);
}

/**
  * @brief  Get the Watchdog Timer behaviour
  * @rmtoll DBGMCU_CR   WDFZCTL   LL_DBGMCU_GetWatchdogTimerBehaviour\n
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DBGMCU_IWDG_FREEZE_1CA35_HALT
  *         @arg @ref LL_DBGMCU_IWDG_FREEZE_2CA35_HALT
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetWatchdogTimerBehaviour(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->CRA35, DBGMCU_CRA35_WDFZCTL));
}

/**
  * @brief  Freeze APB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZ DBG_TIM2_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM3_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM4_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM5_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM6_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM7_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM10_STOP          LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM11_STOP          LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM12_STOP          LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM13_STOP          LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM14_STOP          LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_LPTIM1_STOP         LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_LPTIM2_STOP         LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C1_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C2_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C3_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C4_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C5_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C6_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C7_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I3C1_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I3C2_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I3C3_STOP           LL_DBGMCU_APB1_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM10_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM11_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM12_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM13_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM14_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I3C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I3C2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I3C3_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->APB1FZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->APB1FZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Unfreeze APB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZ DBG_TIM2_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM3_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM4_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM5_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM6_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM7_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM10_STOP          LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM11_STOP          LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM12_STOP          LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM13_STOP          LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_TIM14_STOP          LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_LPTIM1_STOP         LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_LPTIM2_STOP         LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C1_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C2_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C3_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C4_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C5_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C6_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I2C7_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I3C1_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I3C2_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ DBG_I3C3_STOP           LL_DBGMCU_APB1_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM10_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM11_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM12_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM13_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM14_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I3C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I3C2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I3C3_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->APB1FZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->APB1FZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

