zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_system.h
/**
  * @brief  Freeze APB2 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB2FZ DBG_TIM1_STOP           LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM8_STOP           LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM15_STOP          LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM16_STOP          LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM17_STOP          LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM20_STOP          LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ DBG_FDCAN_STOP          LL_DBGMCU_APB2_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM1_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM8_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM15_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM17_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM20_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_FDCAN_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->APB2FZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->APB2FZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Unfreeze APB2 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB2FZ DBG_TIM1_STOP           LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM8_STOP           LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM15_STOP          LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM16_STOP          LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM17_STOP          LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ DBG_TIM20_STOP          LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ DBG_FDCAN_STOP          LL_DBGMCU_APB2_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM1_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM8_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM15_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM17_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM20_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_FDCAN_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->APB2FZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->APB2FZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Freeze APB3 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB3FZ_DBG_IWDG1_STOP          LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ DBG_IWDG2_STOP          LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ DBG_IWDG3_STOP          LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ DBG_IWDG4_STOP          LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ DBG_WWDG1_STOP          LL_DBGMCU_APB3_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG1_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG2_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG3_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG4_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_WWDG1_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB3_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->APB3FZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->APB3FZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Unfreeze APB3 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB3FZ_DBG_IWDG1_STOP          LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ DBG_IWDG2_STOP          LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ DBG_IWDG3_STOP          LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ DBG_IWDG4_STOP          LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ DBG_WWDG1_STOP          LL_DBGMCU_APB3_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG1_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG2_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG3_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_IWDG4_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_WWDG1_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB3_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->APB3FZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->APB3FZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Freeze APB4 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_CRA35_DBG_STGEN_STOP           LL_DBGMCU_APB4_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_CRA35_DBG_STGEN_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB4_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->CRA35, Periphs);
#endif /*CORE_CA35*/
}

/**
  * @brief  Unfreeze APB4 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_CRA35_DBG_STGEN_STOP           LL_DBGMCU_APB4_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_CRA35_DBG_STGEN_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB4_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->CRA35, Periphs);
#endif /*CORE_CA35*/
}

/**
  * @brief  Freeze APBSR peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APBSRFZ DBG_RTC_STOP           LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_I2C8_STOP          LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM3_STOP        LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM4_STOP        LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM5_STOP        LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_IWDG5_STOP         LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_WWDG2_STOP         LL_DBGMCU_APBSR_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_RTC_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_I2C8_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_IWDG5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_WWDG2_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APBSR_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->APBSRFZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->APBSRFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

#if defined (CORE_CM33)
/**
  * @brief  Freeze APBSR peripherals (group1 peripherals) for M0+ delegated to M33.
  * @rmtoll DBGMCU_APBSRFZ DBG_RTC_STOP           LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_I2C8_STOP          LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_I3C4_STOP          LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM3_STOP        LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM4_STOP        LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM5_STOP        LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_IWDG5_STOP         LL_DBGMCU_APBSR_GRP1_FreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_WWDG2_STOP         LL_DBGMCU_APBSR_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_RTC_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_I2C8_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_I3C4_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_IWDG5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_WWDG2_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_C3_DBGMCU_APBSR_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APBSRFZ3, Periphs);
}
#endif /* CORE_CM33 */

/**
  * @brief  Unfreeze APBSR peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APBSRFZ DBG_RTC_STOP           LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_I2C8_STOP          LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_I3C4_STOP          LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM3_STOP        LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM4_STOP        LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM5_STOP        LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_IWDG5_STOP         LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_WWDG2_STOP         LL_DBGMCU_APBSR_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_RTC_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_I2C8_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_I3C4_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_IWDG5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_WWDG2_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APBSR_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->APBSRFZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->APBSRFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

#if defined (CORE_CM33)
/**
  * @brief  Unfreeze APBSR peripherals (group1 peripherals) for M0+ delegated to M33.
  * @rmtoll DBGMCU_APBSRFZ DBG_RTC_STOP           LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_I2C8_STOP          LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM3_STOP        LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM4_STOP        LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_LPTIM5_STOP        LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_IWDG5_STOP         LL_DBGMCU_APBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_APBSRFZ DBG_WWDG2_STOP         LL_DBGMCU_APBSR_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_RTC_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_I2C8_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_LPTIM5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_IWDG5_STOP
  *         @arg @ref LL_DBGMCU_APBSR_GRP1_WWDG2_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_C3_DBGMCU_APBSR_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APBSRFZ3, Periphs);
}
#endif /* CORE_CM33 */

/**
  * @brief  Freeze AHB2 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHB2LFZ DBG_HPDMA1_CH0_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH1_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH2_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH3_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH4_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH5_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH6_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH7_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH8_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH9_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH10_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH11_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH12_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH13_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH14_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH15_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH0_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH1_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH2_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH3_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH4_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH5_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH6_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH7_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH8_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH9_STOP    LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH10_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH11_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH12_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH13_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH14_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH15_STOP   LL_DBGMCU_AHB2_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH3_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH4_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH5_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH6_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH7_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH8_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH9_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH10_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH11_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH12_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH13_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH14_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH15_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH3_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH4_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH5_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH6_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH7_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH8_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH9_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH10_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH11_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH12_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH13_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH14_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH15_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB2_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->AHB2LFZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->AHB2LFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Unfreeze AHB2 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHB2LFZ DBG_HPDMA1_CH0_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH1_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH2_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH3_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH4_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH5_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH6_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH7_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH8_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH9_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH10_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH11_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH12_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH13_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH14_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA1_CH15_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH0_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH1_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH2_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH3_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH4_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH5_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH6_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH7_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH8_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH9_STOP    LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH10_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH11_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH12_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH13_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH14_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHB2LFZ DBG_HPDMA2_CH15_STOP   LL_DBGMCU_AHB2_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH3_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH4_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH5_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH6_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH7_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH8_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH9_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH10_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH11_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH12_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH13_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH14_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA1_CH15_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH3_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH4_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH5_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH6_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH7_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH8_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH9_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH10_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH11_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH12_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH13_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH14_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP1_HPDMA2_CH15_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB2_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->AHB2LFZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->AHB2LFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

