zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_system.h
/**
  * @brief  Freeze AHB2 peripherals (group2 peripherals)
  * @rmtoll DBGMCU_AHB2HFZ DBG_HPDMA3_CH0_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH1_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH2_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH3_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH4_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH5_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH6_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH7_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH8_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH9_STOP    LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH10_STOP   LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH11_STOP   LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH12_STOP   LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH13_STOP   LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH14_STOP   LL_DBGMCU_AHB2_GRP2_FreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH15_STOP   LL_DBGMCU_AHB2_GRP2_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH3_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH4_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH5_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH6_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH7_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH8_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH9_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH10_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH11_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH12_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH13_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH14_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH15_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB2_GRP2_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->AHB2HFZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->AHB2HFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Unfreeze AHB2 peripherals (group2 peripherals)
  * @rmtoll DBGMCU_AHB2HFZ DBG_HPDMA3_CH0_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH1_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH2_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH3_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH4_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH5_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH6_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH7_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH8_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH9_STOP    LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH10_STOP   LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH11_STOP   LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH12_STOP   LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH13_STOP   LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH14_STOP   LL_DBGMCU_AHB2_GRP2_UnFreezePeriph\n
  *         DBGMCU_AHB2HFZ DBG_HPDMA3_CH15_STOP   LL_DBGMCU_AHB2_GRP2_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH3_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH4_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH5_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH6_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH7_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH8_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH9_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH10_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH11_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH12_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH13_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH14_STOP
  *         @arg @ref LL_DBGMCU_AHB2_GRP2_HPDMA3_CH15_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB2_GRP2_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->AHB2HFZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->AHB2HFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

/**
  * @brief  Freeze AHBSR peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHBSRFZ DBG_LPDMA_CH0_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH1_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH2_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH3_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH3_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHBSR_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  SET_BIT(DBGMCU->AHBSRFZ1, Periphs);
#elif defined (CORE_CM33)
  SET_BIT(DBGMCU->AHBSRFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

#if defined (CORE_CM33)
/**
  * @brief  Freeze AHBSR peripherals (group1 peripherals) for M0+ delegated to M33.
  * @rmtoll DBGMCU_AHBSRFZ DBG_LPDMA_CH0_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH1_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH2_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH3_STOP     LL_DBGMCU_AHBSR_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH3_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_C3_DBGMCU_AHBSR_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->AHBSRFZ3, Periphs);
}
#endif /* CORE_CM33 */

/**
  * @brief  Unfreeze AHBSR peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHBSRFZ DBG_LPDMA_CH0_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH1_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH2_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH3_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH3_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined (CORE_CA35)
  CLEAR_BIT(DBGMCU->AHBSRFZ1, Periphs);
#elif defined (CORE_CM33)
  CLEAR_BIT(DBGMCU->AHBSRFZ2, Periphs);
#endif /*CORE_CA35 CORE_CM33*/
}

#if defined (CORE_CM33)
/**
  * @brief  Unfreeze AHBSR peripherals (group1 peripherals) for M0+ delegated to M33.
  * @rmtoll DBGMCU_AHBSRFZ DBG_LPDMA_CH0_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH1_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH2_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph\n
  *         DBGMCU_AHBSRFZ DBG_LPDMA_CH3_STOP     LL_DBGMCU_AHBSR_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH0_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH1_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH2_STOP
  *         @arg @ref LL_DBGMCU_AHBSR_GRP1_LPDMA_CH3_STOP
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_C3_DBGMCU_AHBSR_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->AHBSRFZ3, Periphs);
}
#endif /* CORE_CM33 */

/**
  * @}
  */
#endif /* CORE_CA35 || CORE_CM33 */


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (SYSCFG) || defined (DBGMCU) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_LL_SYSTEM_H */
